UT_Marketplaces.Marketplaces/src/Catalogs/рар_мп_АккаунтыМаркетплейсов/рар_мп_АккаунтыМаркетплейсов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>рар_мп_АккаунтыМаркетплейсов</name>
  <attributes>
    <name>Маркетплейс</name>
    <type>
      <types>EnumRef.рар_мп_Маркетплейсы</types>
    </type>
  </attributes>
  <attributes>
    <name>АктивныйАккаунт</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Ozon_ApiKey</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>400</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ozon_ClientID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>400</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЯМ_ApiKey</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>400</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>BusinessId</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>WB_ApiKey</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>400</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Партнер</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Соглашение</name>
    <type>
      <types>CatalogRef.СоглашенияСКлиентами</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусЗаказа</name>
    <type>
      <types>EnumRef.СтатусыЗаказовКлиентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>Приоритет</name>
    <type>
      <types>CatalogRef.Приоритеты</types>
    </type>
  </attributes>
  <attributes>
    <name>СхемаРаботы</name>
    <type>
      <types>EnumRef.рар_мп_СхемыРаботы</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьМинимальныйОстатокТовара</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МинимальныйОстатокТовара</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Операция</name>
    <type>
      <types>EnumRef.ХозяйственныеОперации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВариантОбеспечения</name>
    <type>
      <types>EnumRef.ВариантыОбеспечения</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦенаВключаетНДС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НалогообложениеНДС</name>
    <type>
      <types>EnumRef.ТипыНалогообложенияНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>РазмерЭтикетокДляЗаказов</name>
    <type>
      <types>EnumRef.рар_мп_ЯндексМаркет_РазмерЯрлыков</types>
      <types>EnumRef.рар_мп_Ozon_РазмерЭтикеток</types>
      <types>EnumRef.рар_мп_Wildberries_РазмерСтикеров</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидЦены_МинимальнаяЦена</name>
    <comment>Минимальная цена товара после применения акций.</comment>
    <type>
      <types>CatalogRef.ВидыЦен</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидЦены_Себестоимость</name>
    <comment>Себестоимость товара.</comment>
    <type>
      <types>CatalogRef.ВидыЦен</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидЦены_ЦенаДоСкидок</name>
    <comment>Цена до скидок</comment>
    <type>
      <types>CatalogRef.ВидыЦен</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидЦены_ЦенаТовараСУчётомСкидок</name>
    <comment>Цена товара с учётом скидок, отображается на карточке товара</comment>
    <type>
      <types>CatalogRef.ВидыЦен</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодключенаДоверительнаяПриемка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаОтменыЗаказа</name>
    <type>
      <types>CatalogRef.ПричиныОтменыЗаказовКлиентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Менеджер</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>СтавкаНДСВознаграждения</name>
    <type>
      <types>CatalogRef.СтавкиНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>Услуга</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>ОперацияОтчетКомиссионера</name>
    <type>
      <types>EnumRef.ХозяйственныеОперации</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяРасходов</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.СтатьиРасходов</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтражатьВБУиНУ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтражатьВУУ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОперацияПередачаНаКомиссию</name>
    <type>
      <types>EnumRef.ХозяйственныеОперации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидЦены_Цена</name>
    <type>
      <types>CatalogRef.ВидыЦен</types>
    </type>
  </attributes>
</mdclass:Catalog>

UT_Marketplaces.Marketplaces/src/Enums/рар_мп_Маркетплейсы/рар_мп_Маркетплейсы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>рар_мп_Маркетплейсы</name>
  <enumValues>
    <name>OZON</name>
  </enumValues>
  <enumValues>
    <name>ЯндексМаркет</name>
  </enumValues>
  <enumValues>
    <name>Wildberries</name>
  </enumValues>
</mdclass:Enum>

UT_Marketplaces.Marketplaces/src/Enums/рар_мп_СхемыРаботы/рар_мп_СхемыРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>рар_мп_СхемыРаботы</name>
  <enumValues>
    <name>FBS</name>
  </enumValues>
  <enumValues>
    <name>FBO</name>
  </enumValues>
</mdclass:Enum>

UT_Marketplaces.Marketplaces/src/Catalogs/рар_мп_АккаунтыМаркетплейсов/Forms/ФормаЭлемента/Module.bsl
&НаСервере
Процедура ПриОткрытииНаСервере()
	
	Если УправлениеДоступом.ЕстьРоль("рар_мп_ОсновнаяРоль") Тогда
	
		Элементы.Маркетплейс.СписокВыбора.Добавить(Перечисления.рар_мп_Маркетплейсы.OZON, "Ozon");
		Элементы.Маркетплейс.СписокВыбора.Добавить(Перечисления.рар_мп_Маркетплейсы.Wildberries, "Wildberries");
		Элементы.Маркетплейс.СписокВыбора.Добавить(Перечисления.рар_мп_Маркетплейсы.ЯндексМаркет, "Яндекс Маркет");
		
	Иначе
		
		Если УправлениеДоступом.ЕстьРоль("рар_мп_Ozon") ИЛИ УправлениеДоступом.ЕстьРоль("рар_мп_Ozon_FBO")  Тогда
			
			Элементы.Маркетплейс.СписокВыбора.Добавить(Перечисления.рар_мп_Маркетплейсы.OZON, "Ozon"); 
			
		КонецЕсли;
		
		
		Если УправлениеДоступом.ЕстьРоль("рар_мп_Wildberries") ИЛИ УправлениеДоступом.ЕстьРоль("рар_мп_Wildberries_FBO") Тогда
			
			Элементы.Маркетплейс.СписокВыбора.Добавить(Перечисления.рар_мп_Маркетплейсы.Wildberries, "Wildberries");
			
		КонецЕсли;
		
		
		Если УправлениеДоступом.ЕстьРоль("рар_мп_ЯндексМаркет") ИЛИ УправлениеДоступом.ЕстьРоль("рар_мп_ЯндексМаркет_FBO") Тогда
			
			Элементы.Маркетплейс.СписокВыбора.Добавить(Перечисления.рар_мп_Маркетплейсы.ЯндексМаркет, "Яндекс Маркет");	
			
		КонецЕсли; 
		
	КонецЕсли; 
	
	Если  Объект.ИспользоватьМинимальныйОстатокТовара Тогда
		
		Элементы.МинимальныйОстатокТовара.Видимость = Истина;
		
	КонецЕсли;  
	
		
	Если  УправлениеДоступом.ЕстьРоль("рар_мп_Ozon") ИЛИ УправлениеДоступом.ЕстьРоль("рар_мп_Wildberries") 
		  ИЛИ УправлениеДоступом.ЕстьРоль("рар_мп_ЯндексМаркет") ИЛИ УправлениеДоступом.ЕстьРоль("рар_мп_ОсновнаяРоль") Тогда
		 
		Элементы.СхемаРаботы.СписокВыбора.Добавить(Перечисления.рар_мп_СхемыРаботы.FBS, "FBS");
		
	КонецЕсли;
	
	Если УправлениеДоступом.ЕстьРоль("рар_мп_Ozon_FBO") ИЛИ УправлениеДоступом.ЕстьРоль("рар_мп_Wildberries_FBO") 
		  ИЛИ УправлениеДоступом.ЕстьРоль("рар_мп_ЯндексМаркет_FBO") ИЛИ УправлениеДоступом.ЕстьРоль("рар_мп_ОсновнаяРоль") Тогда
		
		Элементы.СхемаРаботы.СписокВыбора.Добавить(Перечисления.рар_мп_СхемыРаботы.FBO, "FBO");
		
	КонецЕсли;
			
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПриОткрытииНаСервере();
	
	МаркетплейсПриИзмененииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура МаркетплейсПриИзмененииНаСервере()
	
	Если ЗначениеЗаполнено(Объект.Маркетплейс) Тогда
	
		Если Объект.Маркетплейс = Перечисления.рар_мп_Маркетплейсы.OZON Тогда
	
			Элементы.Ozon_ApiKey.Видимость = Истина;
			
			Элементы.Ozon_ClientID.Видимость = Истина;
			
			Элементы.ЯМ_ApiKey.Видимость = Ложь;
			
			Элементы.BusinessId.Видимость = Ложь;
			
			Элементы.WB_ApiKey.Видимость = Ложь;
			
			Элементы.РазмерЭтикетовДляЗаказов.Видимость = Истина;
			
			Элементы.РазмерЭтикетовДляЗаказов.ОграничениеТипа = Новый ОписаниеТипов("ПеречислениеСсылка.рар_мп_Ozon_РазмерЭтикеток");
			
			Элементы.ВидЦены_МинимальнаяЦена.Видимость          = Истина;  
			
			Элементы.ВидЦены_Себестоимость.Видимость            = Истина;      
			
			Элементы.ВидЦены_ЦенаДоСкидок.Видимость             = Истина;  
			
			Элементы.ВидЦены_ЦенаТовараСУучётомСкидок.Видимость = Истина;
			
			Элементы.ВидЦены_Цена.Видимость						= Ложь;
			
			Элементы.ПодключенаДоверительнаяПриемка.Видимость	= Истина;
			
		ИначеЕсли Объект.Маркетплейс = Перечисления.рар_мп_Маркетплейсы.Wildberries Тогда
			
			Элементы.Ozon_ApiKey.Видимость = Ложь;
			
			Элементы.Ozon_ClientID.Видимость = Ложь;
			
			Элементы.ЯМ_ApiKey.Видимость = Ложь;
			
			Элементы.BusinessId.Видимость = Ложь;
			
			Элементы.WB_ApiKey.Видимость = Истина;
			
			Элементы.РазмерЭтикетовДляЗаказов.Видимость = Истина;
			
			Элементы.РазмерЭтикетовДляЗаказов.ОграничениеТипа = Новый ОписаниеТипов("ПеречислениеСсылка.рар_мп_Wildberries_РазмерСтикеров");
			
			Элементы.ВидЦены_МинимальнаяЦена.Видимость          = Ложь;  
			
			Элементы.ВидЦены_Себестоимость.Видимость            = Ложь;      
			
			Элементы.ВидЦены_ЦенаДоСкидок.Видимость             = Ложь;  
			
			Элементы.ВидЦены_ЦенаТовараСУучётомСкидок.Видимость = Ложь;
			
			Элементы.ВидЦены_Цена.Видимость						= Истина;
			
			Элементы.ПодключенаДоверительнаяПриемка.Видимость	= Ложь;
				
		ИначеЕсли Объект.Маркетплейс = Перечисления.рар_мп_Маркетплейсы.ЯндексМаркет Тогда
		
			Элементы.Ozon_ApiKey.Видимость = Ложь;
			
			Элементы.Ozon_ClientID.Видимость = Ложь;
			
			Элементы.ЯМ_ApiKey.Видимость = Истина;
			
			Элементы.BusinessId.Видимость = Истина;
			
			Элементы.WB_ApiKey.Видимость = Ложь;
			
			Элементы.РазмерЭтикетовДляЗаказов.Видимость = Истина;
			
			Элементы.РазмерЭтикетовДляЗаказов.ОграничениеТипа = Новый ОписаниеТипов("ПеречислениеСсылка.рар_мп_ЯндексМаркет_РазмерЯрлыков");
			
			Элементы.ВидЦены_МинимальнаяЦена.Видимость          = Ложь;  
			
			Элементы.ВидЦены_Себестоимость.Видимость            = Ложь;      
			
			Элементы.ВидЦены_ЦенаДоСкидок.Видимость             = Истина;  
			
			Элементы.ВидЦены_ЦенаТовараСУучётомСкидок.Видимость = Истина;  
			
			Элементы.ВидЦены_Цена.Видимость						= Ложь;
			
			Элементы.ПодключенаДоверительнаяПриемка.Видимость	= Ложь;
			
		КонецЕсли;	
	
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура МаркетплейсПриИзменении(Элемент)
	МаркетплейсПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьМинимальныйОстатокТовараПриИзменении(Элемент)
	
	Если Объект.ИспользоватьМинимальныйОстатокТовара = Истина Тогда
		
		Элементы.МинимальныйОстатокТовара.Видимость = Истина;
		
	Иначе
		
		Объект.МинимальныйОстатокТовара             = 0;
	    Элементы.МинимальныйОстатокТовара.Видимость = Ложь;  
		
	КонецЕсли; 
	
КонецПроцедуры
